# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

import random

text = 'абвбмдлал врпорлт еапвитд шгоьл прабв абв'

text = text.split(' ')
print(text)
