# 2. Найдите корни квадратного уравнения Ax² + Bx + C = 0 с помощью 
# математических формул нахождения корней квадратного уравнения

a = int(input("введите a: "))
b = int(input("введите b: "))
c = int(input("введите c: "))
print(f'квадратное уравнение: {a}x*x + {b}*x + {c} = 0')
#дискриминант
d = b * b - 4 * a * c
if d > 0:
    sqrtD = d ** (1/2)

    x1 = (-b + sqrtD)/(2 * a)
    x2 = (-b - sqrtD)/(2 * a)

    print(f'корни квадратного уравнения:\nx1 = {x1}\nx2 = {x2}')
elif d == 0:
    x = -b / (2 * a)
    print(round(x, 3))
else:
    print('Error!')
